In [1]:
import pandas as pd
import numpy as np

In [2]:
def get_data():
    return [[10, 20], [30, 40], [50, 60], [70, 80]]

def get_data_frame():
    data = [[10, 20], [30, 40], [50, 60], [70, 80]]
    return pd.DataFrame(data)

def get_dict_list():
    return [{'kor': 10, 'eng': 20}, {'kor': 30, 'eng': 40}, 
            {'kor': 50, 'eng': 60}, {'kor': 70, 'eng': 80}]

def get_dict():
    return {"kor": [10, 30, 50, 70], "eng": [20, 40, 60, 80],
           'math': [33, 44, 55, 66]}

def get_dict_data_frame():
    return pd.DataFrame(get_dict(), index=['a', 'b', 'c', 'd'])

In [3]:
# 추가
df = get_dict_data_frame()

In [4]:
df

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55
d   70   80    66

In [5]:
df.max()

kor     70
eng     80
math    66
dtype: int64

In [6]:
type(df.max())

pandas.core.series.Series

In [7]:
df.loc['max'] = df.max()
df

     kor  eng  math
a     10   20    33
b     30   40    44
c     50   60    55
d     70   80    66
max   70   80    66

In [8]:
df.max(axis=1)

a      33
b      44
c      60
d      80
max    80
dtype: int64

In [9]:
df['max'] = df.max(axis=1)
df

     kor  eng  math  max
a     10   20    33   33
b     30   40    44   44
c     50   60    55   60
d     70   80    66   80
max   70   80    66   80

In [10]:
df = get_dict_data_frame()
df

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55
d   70   80    66

In [11]:
print(df.max())
print()
print(df.max().max())

kor     70
eng     80
math    66
dtype: int64

80

In [12]:
df.sum(axis=1)

a     63
b    114
c    165
d    216
dtype: int64

In [13]:
df['sum'] = df.sum(axis=1)

In [14]:
df

   kor  eng  math  sum
a   10   20    33   63
b   30   40    44  114
c   50   60    55  165
d   70   80    66  216

In [15]:
df.sum().sum()

1116

In [16]:
# df.loc('sum') = df.sum()
df.loc['sum'] = df.sum()

In [17]:
df

     kor  eng  math  sum
a     10   20    33   63
b     30   40    44  114
c     50   60    55  165
d     70   80    66  216
sum  160  200   198  558

In [18]:
df.std()

kor      58.137767
eng      70.710678
math     67.540358
sum     195.651987
dtype: float64

In [19]:
df.mean()

kor      64.0
eng      80.0
math     79.2
sum     223.2
dtype: float64

In [20]:
df.quantile([0.5, 0.2, 0.9])

       kor    eng   math    sum
0.5   50.0   60.0   55.0  165.0
0.2   26.0   36.0   41.8  103.8
0.9  124.0  152.0  145.2  421.2

In [21]:
df.median()

kor      50.0
eng      60.0
math     55.0
sum     165.0
dtype: float64

In [22]:
df.count()

kor     5
eng     5
math    5
sum     5
dtype: int64

In [23]:
df

     kor  eng  math  sum
a     10   20    33   63
b     30   40    44  114
c     50   60    55  165
d     70   80    66  216
sum  160  200   198  558

In [24]:
df.drop('sum', inplace=True)
df.drop(columns=['sum'], inplace=True)

In [25]:
df.describe()

             kor        eng       math
count   4.000000   4.000000   4.000000
mean   40.000000  50.000000  49.500000
std    25.819889  25.819889  14.200939
min    10.000000  20.000000  33.000000
25%    25.000000  35.000000  41.250000
50%    40.000000  50.000000  49.500000
75%    55.000000  65.000000  57.750000
max    70.000000  80.000000  66.000000

In [26]:
df.describe().loc['mean']

kor     40.0
eng     50.0
math    49.5
Name: mean, dtype: float64